In [1]:
import pandas as pd
import numpy as np

In [2]:
table = pd.read_csv("student-mat.csv")

In [3]:
table.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

In [4]:
table.head().iloc[:,0:10]

  school sex  age address famsize Pstatus  Medu  Fedu     Mjob      Fjob
0     GP   F   18       U     GT3       A     4     4  at_home   teacher
1     GP   F   17       U     GT3       T     1     1  at_home     other
2     GP   F   15       U     LE3       T     1     1  at_home     other
3     GP   F   15       U     GT3       T     4     2   health  services
4     GP   F   16       U     GT3       T     3     3    other     other

In [5]:
table.head().iloc[:,10:19]

,reason,guardian,traveltime,studytime,failures,schoolsup,famsup,paid,activities
0,course,mother,2,2,0,yes,no,no,no
1,course,father,1,2,0,no,yes,no,no
2,other,mother,1,2,3,yes,no,yes,no
3,home,mother,1,3,0,no,yes,yes,yes
4,home,father,1,2,0,no,yes,yes,no

In [6]:
table.head().iloc[:,20:31]

,higher,internet,romantic,famrel,freetime,goout,Dalc,Walc,health,absences,G1
0,yes,no,no,4,3,4,1,1,3,6,5
1,yes,yes,no,5,3,3,1,1,3,4,5
2,yes,yes,no,4,3,2,2,3,3,10,7
3,yes,yes,yes,3,2,2,1,1,5,2,15
4,yes,no,no,4,3,2,1,2,5,4,6

# Do wyrzucenia:
## School
## Mjob
## Fjob
## Reason
## guardian

In [7]:
dropped = table.drop(columns=["school","Mjob","Fjob","reason","guardian"])

In [8]:
dropped.head()

,sex,age,address,famsize,Pstatus,Medu,Fedu,traveltime,studytime,failures,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,F,18,U,GT3,A,4,4,2,2,0,...,4,3,4,1,1,3,6,5,6,6
1,F,17,U,GT3,T,1,1,1,2,0,...,5,3,3,1,1,3,4,5,5,6
2,F,15,U,LE3,T,1,1,1,2,3,...,4,3,2,2,3,3,10,7,8,10
3,F,15,U,GT3,T,4,2,1,3,0,...,3,2,2,1,1,5,2,15,14,15
4,F,16,U,GT3,T,3,3,1,2,0,...,4,3,2,1,2,5,4,6,10,10

In [9]:
dropped.loc[:,"internet"]

0       no
1      yes
2      yes
3      yes
4       no
5      yes
6      yes
7       no
8      yes
9      yes
10     yes
11     yes
12     yes
13     yes
14     yes
15     yes
16     yes
17      no
18     yes
19     yes
20     yes
21     yes
22     yes
23     yes
24     yes
25     yes
26     yes
27     yes
28     yes
29     yes
      ...
365     no
366    yes
367    yes
368    yes
369    yes
370     no
371    yes
372     no
373    yes
374    yes
375    yes
376    yes
377    yes
378    yes
379    yes
380    yes
381    yes
382    yes
383     no
384     no
385     no
386    yes
387    yes
388    yes
389     no
390     no
391    yes
392     no
393    yes
394    yes
Name: internet, Length: 395, dtype: object

In [10]:
dropped.loc[:,"internet"] = pd.factorize(dropped.loc[:,"internet"])[0]

In [11]:
dropped.loc[:,"sex"] = pd.factorize(dropped.loc[:,"sex"])[0]

In [12]:
dropped.loc[:,"address"] = pd.factorize(dropped.loc[:,"address"])[0]

In [13]:
dropped.loc[:,"famsize"] = pd.factorize(dropped.loc[:,"famsize"])[0]

In [14]:
dropped.loc[:,"Pstatus"] = pd.factorize(dropped.loc[:,"Pstatus"])[0]

In [15]:
dropped.loc[:,"schoolsup"] = pd.factorize(dropped.loc[:,"schoolsup"])[0]

In [16]:
dropped.loc[:,"famsup"] = pd.factorize(dropped.loc[:,"famsup"])[0]

In [17]:
dropped.loc[:,"paid"] = pd.factorize(dropped.loc[:,"paid"])[0]

In [18]:
dropped.loc[:,"activities"] = pd.factorize(dropped.loc[:,"activities"])[0]

In [19]:
dropped.loc[:,"nursery"] = pd.factorize(dropped.loc[:,"nursery"])[0]

In [20]:
dropped.loc[:,"higher"] = pd.factorize(dropped.loc[:,"higher"])[0]

In [21]:
dropped.loc[:,"romantic"] = pd.factorize(dropped.loc[:,"romantic"])[0]

In [23]:
dropped.head()

,sex,age,address,famsize,Pstatus,Medu,Fedu,traveltime,studytime,failures,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,0,18,0,0,0,4,4,2,2,0,...,4,3,4,1,1,3,6,5,6,6
1,0,17,0,0,1,1,1,1,2,0,...,5,3,3,1,1,3,4,5,5,6
2,0,15,0,1,1,1,1,1,2,3,...,4,3,2,2,3,3,10,7,8,10
3,0,15,0,0,1,4,2,1,3,0,...,3,2,2,1,1,5,2,15,14,15
4,0,16,0,0,1,3,3,1,2,0,...,4,3,2,1,2,5,4,6,10,10

In [24]:
Dalc = dropped.loc[:,"Dalc"]

In [25]:
Walc = dropped.loc[:,"Walc"]

In [26]:
X = dropped.drop(columns = ["Dalc","Walc"])

In [27]:
X = pd.concat([X.assign(x0=1).loc[:,"x0"], X], axis = 1)

x0             1
sex            0
age           18
address        0
famsize        0
Pstatus        0
Medu           4
Fedu           4
traveltime     2
studytime      2
failures       0
schoolsup      0
famsup         0
paid           0
activities     0
nursery        0
higher         0
internet       0
romantic       0
famrel         4
freetime       3
goout          4
health         3
absences       6
G1             5
G2             6
G3             6
Name: 0, dtype: int64